{
	"2021-11-13": "Alternate fire for super ships will be added when I have time.",
	"2021-06-26": "0.10.5.0 update was delayed pending Arirang camo decision",
	"2021-01-24": "0.10.0.0 commander skills are updated.",
	"2020-08-06": "New flags will be added later.",
	"2020-06-11": "Ship Comparison added for testing.",
	"2020-04-30": "Google Ad enabled by default while making adjustment. Feel free to opt in or out.",
	"2020-04-18": "Ads added, disabled by default. Feel free to opt in or out.",
	"2020-03-12": "Currently working on IFHE changes",
	"2020-01-25": "Flags are available for configuration",
	"2020-01-15": "Mistakes were made, bugs were fixed (top engine using stock data, and vice versa).",
	"2019-12-24": "Vigilance affects Hydro's torpedo detection.",
	"2019-12-17": "IFHE bug (deducting 1 mm more) regarding some gun calibers fixed",
	"2019-12-11": "Due to IRL related issues, Patreon donation was added.",
	"2019-08-23": "0.8.7.0 AA WIP",
	"2019-08-17": "I am against Research Bureau which is Naval Training Center Mk.II.",
	"2019-07-26": "Busy with IRL, update will be slow for a while.",
	"2019-07-06": "Service restored after protest on NTC",
	"2019-04-15": "Test ships added back",
	"2019-02-27": "0.8.0.3 update and Bug fixes",
	"2019-02-24": "Some special commanders added. Skill selection limit can be toggled on/off (19 pts limit still apply).<br />Bug fixes ongoing when spotted.",
	"2019-02-19": "Source code reworked from ground zero. Should see better performance overall.<br />Korean language support added, with possibly more to come.<br />Some features removed until further notice.<br />Gonna rest a bit since I worked on this for 12 hours a day past 3 weeks.",
	"2019-01-30": "AA changes implemented. Please report if there are any issues.<br /><br />Carriers removed until CV changes in 0.8.0 are fully implemented here.<br />Flags removed until WG API implements them properly.",
	"2018-10-24": "Max dispersion calculation corrected",
	"2018-10-22": "Vertical dispersion is now affected by accuracy bonus change.",
	"2018-09-19": "Updated for 0.7.9.0. However research xp calculation for UK DD does not work.",
	"2018-05-16": "Added Artillery Chart for testing",
	"2018-04-18": "New UI is implemented for Fitting Tool and Ship Comparison.",
	"2018-04-14": "URL Minify for Fitting Tool section is implemented",
	"2018-04-13": "Ship Comparison may be giving error on some occasions. I'm working on a fix.<br />Update: Fixed, monitoring for now.",
	"2018-02-08": "Fixed CV's AP Bombers not showing up",
	"2017-10-20": "Modified server to block malicious bots",
	"2017-09-18": "Added dive bomber accuracy",
	"2017-09-04": "Added Artillery/Torpedo angle sector for testing",
	"2017-08-25": "Fixed bug regarding AP shell penetration",
	"2017-08-18": "Added fuse time for AP shells",
	"2017-08-10": "Added unique skills/talents for valid commander",
	"2017-08-08": "Added special captains for valid nations.",
	"2017-05-23": "Added special modules to each valid ship.",
	"2017-05-01": "Added Ship Comparison and Research Tree for testing",
	"2017-04-19": "Added consumables for testing.",
	"2017-04-13": "Added mobile version and flags for testing.",
	"2017-04-05": "WoWS API is finally working again!",
	"2017-03-17": "WoWS API is still broken (blame Wargaming). Fixed server issue that was related to new update.",
	"2016-12-08": "WoWS API is still not working properly with 0.5.15.1. I'm still in the process of talking with Wargaming CS but it'll take a while due to response time.",
	"2016-12-01": "WoWS API has bug with 0.5.15.0 so only stock ship values are being returned at the moment.<br />I notified Wargaming so hopefully it'll be fixed soon."
}